In [1]:
import pandas as pd
import numpy as np

In [32]:
ipl_data ={'Team' : ['Riders', 'Riders', 'Devils', 'Devils', 'Kings', 'Kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals',
                    'Riders'],
          'Rank': [1,2,2,3,3,4,1,2,4,1,2,1],
          'Year':[2014,2015,2014,2015,2015,2016,2017,2016,2014,2015,2017,2016],
          'points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data, columns=['Team', 'Rank', 'Year', 'points'])
print(df)

      Team  Rank  Year  points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2015     741
5    Kings     4  2016     812
6    Kings     1  2017     756
7    Kings     2  2016     788
8   Riders     4  2014     694
9   Royals     1  2015     701
10  Royals     2  2017     804
11  Riders     1  2016     690

In [33]:
df.head(3)

     Team  Rank  Year  points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863

# SELECT TEAM, RANK, POINTS from ipl_data LINIT 3

In [34]:
df[['Team', 'Rank', 'points']].head(3)

     Team  Rank  points
0  Riders     1     876
1  Riders     2     789
2  Devils     2     863

# SELECT * From ipl_data WHERE year 2014

In [35]:
df[df['Year'] == 2014]

     Team  Rank  Year  points
0  Riders     1  2014     876
2  Devils     2  2014     863
8  Riders     4  2014     694

# SELECT * From ipl_data WHERE Team = 'Rider' and  Year = 2014

In [36]:
df[(df["Team"] == 'Rider')&(df['Year']== 2014)]

Empty DataFrame
Columns: [Team, Rank, Year, points]
Index: []

# SELECT * From ipl_data WHERE Team = 'Rider' and  Year = 2014

In [37]:
df[(df["Team"] == 'Rider')|(df['Year']== 2014)]

     Team  Rank  Year  points
0  Riders     1  2014     876
2  Devils     2  2014     863
8  Riders     4  2014     694

# SELECT RANK and YEAR From ipl_data WHERE Team = 'Riders'

In [43]:
x = df[df['Team'] == 'Riders']
x[['Rank', 'Year']]

    Rank  Year
0      1  2014
1      2  2015
8      4  2014
11     1  2016

# GroupBy

In [62]:
#create DataFrame
data = {'Company':['GOOG', 'GOOG', 'FB', 'FB', 'MSFT', 'MSFT', 'MSFT'],
     'Person' : ['Vishal', 'Akshay', 'Pranay', 'Veena', 'Satish', 'Atul', 'Dave'],
     'Sales': [200,120,340,124,243,350,265]}

df = pd.DataFrame(data)
print(df)

  Company  Person  Sales
0    GOOG  Vishal    200
1    GOOG  Akshay    120
2      FB  Pranay    340
3      FB   Veena    124
4    MSFT  Satish    243
5    MSFT    Atul    350
6    MSFT    Dave    265

In [63]:
df.groupby(['Company'])['Sales'].mean()

Company
FB      232
GOOG    160
MSFT    286
Name: Sales, dtype: int64

In [64]:
df.groupby(['Company']).mean()

         Sales
Company
FB         232
GOOG       160
MSFT       286

In [65]:
df['newColumn'] = [i/2 for i in df['Sales']]
print(df)

  Company  Person  Sales  newColumn
0    GOOG  Vishal    200      100.0
1    GOOG  Akshay    120       60.0
2      FB  Pranay    340      170.0
3      FB   Veena    124       62.0
4    MSFT  Satish    243      121.5
5    MSFT    Atul    350      175.0
6    MSFT    Dave    265      132.5

In [66]:
print(df.groupby(['Company'])['Sales'].mean())

Company
FB      232
GOOG    160
MSFT    286
Name: Sales, dtype: int64

In [67]:
print(df.groupby(['Company']).mean())

         Sales  newColumn
Company
FB         232      116.0
GOOG       160       80.0
MSFT       286      143.0

In [68]:
#find Standard Deviation by Company
print(df.groupby(['Company'])['Sales'].std())

Company
FB      152.735065
GOOG     56.568542
MSFT     56.506637
Name: Sales, dtype: float64

In [69]:
print(df.groupby(['Company'])['Sales'].min())

Company
FB      124
GOOG    120
MSFT    243
Name: Sales, dtype: int64

In [70]:
#find min person name by company
print(df.groupby(['Company'])['Person'].min())

Company
FB      Pranay
GOOG    Akshay
MSFT      Atul
Name: Person, dtype: object

In [71]:
#count # of sales fig present from each company
print(df.groupby(['Company'])['Sales'].count())

Company
FB      2
GOOG    2
MSFT    3
Name: Sales, dtype: int64

# Concatenation

In [74]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                   'B':['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                    'D':['D0','D1','D2','D3']},
                    index = [1,2,3,4])
print(df1)

    A   B   C   D
1  A0  B0  C0  D0
2  A1  B1  C1  D1
3  A2  B2  C2  D2
4  A3  B3  C3  D3

In [75]:
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                   'B':['B4', 'B5', 'B6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                    'D':['D4','D5','D6','D7']},
                    index = [1,2,3,4])
print(df2)

    A   B   C   D
1  A4  B4  C4  D4
2  A5  B5  C5  D5
3  A6  B6  C6  D6
4  A7  B7  C7  D7

In [76]:
df3 = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],
                   'B':['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                    'D':['D8','D9','D10','D11']},
                    index = [1,2,3,4])
print(df3)

     A    B    C    D
1   A8   B8   C8   D8
2   A9   B9   C9   D9
3  A10  B10  C10  D10
4  A11  B11  C11  D11

In [77]:
print(pd.concat([df1, df2, df3], axis=0))

     A    B    C    D
1   A0   B0   C0   D0
2   A1   B1   C1   D1
3   A2   B2   C2   D2
4   A3   B3   C3   D3
1   A4   B4   C4   D4
2   A5   B5   C5   D5
3   A6   B6   C6   D6
4   A7   B7   C7   D7
1   A8   B8   C8   D8
2   A9   B9   C9   D9
3  A10  B10  C10  D10
4  A11  B11  C11  D11

In [78]:
print(pd.concat([df1, df2, df3], axis=0, ignore_index = "True"))

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [79]:
print(pd.concat([df1,df2,df3], axis = 1))

    A   B   C   D   A   B   C   D    A    B    C    D
1  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
2  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
3  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
4  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [80]:
print(pd.concat([df1,df2,df3], axis = 1, ignore_index = "True"))

   0   1   2   3   4   5   6   7    8    9    10   11
1  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
2  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
3  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
4  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [81]:
df4 = pd.DataFrame({'A':['A12', 'A13', 'A14', 'A15'],
                   'B':['B12', 'B13', 'B14', 'B15'],
                   'C': ['C12', 'C13', 'C14', 'C15'],
                    'D':['D12','D13','D14','D15']},
                    index = [0,1,2,3])
print(df4)

     A    B    C    D
0  A12  B12  C12  D12
1  A13  B13  C13  D13
2  A14  B14  C14  D14
3  A15  B15  C15  D15

In [82]:
df5 = pd.DataFrame({'A':['A16', 'A17', 'A18', 'A19'],
                   'B':['B16', 'B17', 'B18', 'B19'],
                   'C': ['C16', 'C17', 'C18', 'C19'],
                    'D':['D16','D17','D18','D19']},
                    index = [0,1,2,3])
print(df5)

     A    B    C    D
0  A16  B16  C16  D16
1  A17  B17  C17  D17
2  A18  B18  C18  D18
3  A19  B19  C19  D19

In [84]:
print(pd.concat([df1,df4], axis =1))

     A    B    C    D    A    B    C    D
0  NaN  NaN  NaN  NaN  A12  B12  C12  D12
1   A0   B0   C0   D0  A13  B13  C13  D13
2   A1   B1   C1   D1  A14  B14  C14  D14
3   A2   B2   C2   D2  A15  B15  C15  D15
4   A3   B3   C3   D3  NaN  NaN  NaN  NaN

# Merging

In [102]:
df_1 = pd.DataFrame({'Key':['K0','K1','K2','K3','K4'],
                    'A': ['A0','A1','A2','A3','A5'],
                    'B': ['B0','B1','B2','B3','B5']})

df_R = pd.DataFrame({'Key':['K0','K1','K2','K3','K4'],
                    'C': ['C0','C1','C2','C3','C4'],
                    'D': ['D0','D1','D2','D3','D4']})

print(df_1)

print(df_R)

    A   B Key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3
4  A5  B5  K4
    C   D Key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3
4  C4  D4  K4

In [103]:
pd.merge(df_1,df_R, how='inner', on= 'Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3
4  A5  B5  K4  C4  D4

In [104]:
pd.merge(df_1,df_R, how='left',on = 'Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3
4  A5  B5  K4  C4  D4

In [105]:
pd.merge(df_1,df_R, how='right', on = 'Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3
4  A5  B5  K4  C4  D4

In [106]:
pd.merge(df_1,df_R, how='outer',on='Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3
4  A5  B5  K4  C4  D4

In [107]:
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
    Merge DataFrame objects by performing a database-style join operation by
    columns or indexes.

    If joining columns on columns, the DataFrame indexes *will be
    ignored*. Otherwise if joining indexes on indexes or indexes on a column or
    columns, the index will be passed on.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : boolean, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels
    right_index : boolean, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index
    sort : boolean, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword)
    suffixes : 2-length sequence (tuple, list, ...)
        Suffix to apply to overlapping column names in the left and right
        side, respectively
    copy : boolean, default True
        If False, do not copy data unnecessarily
    indicator : boolean or string, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : string, default None
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0

    Examples
    --------

    >>> A              >>> B
        lkey value         rkey value
    0   foo  1         0   foo  5
    1   bar  2         1   bar  6
    2   baz  3         2   qux  7
    3   foo  4         3   bar  8

    >>> A.merge(B, left_on='lkey', right_on='rkey', how='outer')
       lkey  value_x  rkey  value_y
    0  foo   1        foo   5
    1  foo   4        foo   5
    2  bar   2        bar   6
    3  bar   2        bar   8
    4  baz   3        NaN   NaN
    5  NaN   NaN      qux   7

    Returns
    -------
    merged : DataFrame
        The output type will the be same as 'left', if it is a subclass
        of DataFrame.

    See also
    --------
    merge_ordered
    merge_asof
    DataFrame.join